{
  "global.title": {
    "message": "Dr Alejandro Coca-Castro",
    "description": "The website title"
  },
  "global.tagline": {
    "message": "Open Environmental Science",
    "description": "The website tagline"
  },
  "global.description": {
    "message": "Alejandro's personal site, a blog about everything, especially my path in Open Science",
    "description": "The website description"
  },
  "homepage.description.descriptionLine_4": {
    "message": "I contribute to open source initiatives",
    "description": "The fourth line of description"
  },
  "homepage.description.descriptionLine_1": {
    "message": "Geography, Maps & Data Science",
    "description": "The first line of description"
  },
  "homepage.description.descriptionLine_2": {
    "message": "Disruptive technologies with social impact",
    "description": "The second line of description"
  },
  "homepage.description.descriptionLine_3": {
    "message": "I share knowledge through my Blog",
    "description": "The third line of description"
  },
  "Libro de ciencias de datos ambientales": {
    "message": "Environmental Data Science book"
  },
  "Recurso dirigido por la comunidad para visibilizar y apoyar la publicación de datos, investigación y herramientas de ciencias ambientales": {
    "message": "Community-driven resource to support the publication of data, research and tools in environmental science"
  },
  "Mayo 2021 - Presente": {
    "message": "May 2021 - Present"
  },
  "Con la plétora de datos abiertos y recursos computacionales disponibles, la investigación y las aplicaciones de la ciencia de los datos medioambientales se han acelerado rápidamente. Por lo tanto, existe la oportunidad de proponer una nueva ciberinfraestructura para recopilar y clasificar la investigación y las aplicaciones de código abierto en los sistemas medioambientales (polares, océanos, bosques, agricultura, etc.). Inspirados en la Galería de Pangeo, proponemos el libro de ciencias de datos medioambientales o The Environmental Data Science book (https://the-environmental-ds-book.netlify.app), un recurso en línea impulsado por la comunidad que muestra y apoya la publicación de datos, investigaciones y desarrollos de código abierto en las ciencias ambientales. El público objetivo y los primeros en adoptarlo son": {
    "message": "With the plethora of open data and computational resources available, environmental data science research and applications have rapidly accelerated. Therefore, there is an opportunity to propose a new cyberinfrastructure to collect and classify open source research and applications in environmental systems (polar, oceans, forests, agriculture, etc.). Inspired by the Pangeo Gallery, we propose The Environmental Data Science book (https://the-environmental-ds-book.netlify.app), a community-driven online resource that showcases and supports the publication of data, research, and open source developments in environmental science. The target audience and early adopters are"
  },
  "cualquier persona interesada en herramientas de código abierto para la ciencia medioambiental": {
    "message": "anyone interested in open source tools for environmental science"
  },
  "cualquier persona interesada en la reproducibilidad, la inclusión, la compartición y la colaboración de la IA y la ciencia de los datos para aplicaciones medioambientales": {
    "message": "anyone interested in reproducibility, inclusiveness, sharing and collaboration aspects of AI and data science for environmental applications"
  },
  "Siguiendo los principios FAIR del inglés (findable, accesible, interoperable y reusable), el recurso ofrece múltiples características como directrices, plantillas, URLs persistentes y Binder para facilitar contenido totalmente documentado, compartible y reproducible. La calidad del contenido publicado está garantizada por un proceso de revisión transparente apoyado por tecnologías relacionadas con GitHub. Hasta la fecha, la comunidad ha publicado con éxito siete contenido ejecutables basados en python: uno de agricultura, dos de bosques, dos de incendios forestales/sabana, uno de investigación oceánica y uno de investigación polar. El contenido utiliza bibliotecas de código abierto de python, como intake, iris, xarray y hvplot, para la visualización interactiva y la modelización de datos de sensores medioambientales. Además de las constantes mejoras de las características del repositorio de GitHub esperamos aumentar las contribuciones de otros lenguajes de programación, por ejemplo, Julia y R, y organizar más actividades de la comunidad (sesiones de colaboración y coworking) para mejorar las prácticas de software científico en la comunidad de ciencias ambientales.": {
    "message": "Following the FAIR (findable, accessible, interoperable and reusable) principles, the resource offers multiple features such as guidelines, templates, persistent URLs and Binder to facilitate fully documented, shareable and reproducible content. The quality of published content is assured by a transparent review process supported by GitHub-related technologies. To date, the community has successfully published seven Python-based executable content: one agriculture, two forestry, two forest/savanna fire, one ocean research, and one polar research. The content uses open source Python libraries, such as intake, iris, xarray and hvplot, for interactive visualization and modeling of environmental sensor data. In addition to constant feature enhancements to the GitHub repository we hope to increase contributions from other programming languages, e. g. Julia and R, and to organize more community activities (collaboration and coworking sessions) to improve scientific software practices in the environmental science community."
  },
  "The Turing Way es un libro, una comunidad y una colaboración global para la ciencia de datos reproducible, ética y colaborativa": {
    "message": "The Turing Way is a book, a community and a global collaboration for reproducible, ethical and collaborative data science"
  },
  "The Turing Way es una guía práctica para la ciencia de datos reproducible, ética y colaborativa. Apoyamos una comunidad diversa de colaboradores para conseguir una ciencia de datos accesible, comprensible y efectiva para todos. Nuestro objetivo es proporcionar toda la información que los investigadores y científicos de datos en la academia, la industria y el sector público necesitan al inicio de sus proyectos para asegurar que sean fáciles de reproducir al final.": {
    "message": "The Turing Way is a practical guide to reproducible, ethical and collaborative data science. We support a diverse community of collaborators to make data science accessible, understandable, and effective for all. Our goal is to provide all the information that researchers and data scientists in academia, industry, and the public sector need at the start of their projects to ensure that they are easy to reproduce at the end."
  },
  "The Turing Way comenzó en 2019 como una pequeña guía de ciencia de datos, y desde entonces se ha expandido hasta formar manual mucho más completo formado por múltiples guías que abarcan varios temas: Investigación Reproducible, Diseño de Proyectos, Comunicación, Colaboración e Investigación Ética. Cada guía ofrece capítulos sobre una variedad de temas que cubren buenas prácticas y recomendaciones. Estos capítulos han sido co-escritos por personas que colaboran y que son estudiantes, investigadores/as, docentes, líderes comunitarios, políticos/as y profesionales de diversos orígenes, experiencias vividas y conocimiento del dominio.": {
    "message": "The Turing Way began in 2019 as a small data science guide, and has since expanded into a much more comprehensive manual consisting of multiple guides covering several topics: Reproducible Research, Project Design, Communication, Collaboration, and Ethical Research. Each guide offers chapters on a variety of topics covering best practices and recommendations. These chapters have been co-written by contributors who are students, researchers, teachers, community leaders, policy makers and practitioners of diverse backgrounds, lived experience and domain knowledge."
  },
  "Todas las partes interesadas, incluyendo estudiantes, investigadores/as, ingenieros/as de software, líderes de proyectos y equipos fundadores, están invitados/as a usar The Turing Way para entender sus roles y sus responsabilidades en la reproducibilidad de la ciencia de datos. Puede leer el libro online, contribuir al proyecto tal como se describe en nuestras guías para contribuir al proyecto y reutilizar todos los materiales (ver la Licencia).": {
    "message": "All interested parties, including students, researchers, software engineers, project leaders and founding teams, are invited to use The Turing Way to understand their roles and responsibilities in data science reproducibility. You can read the book online, contribute to the project as described in our guidelines for contributing to the project, and reuse all materials (see License)."
  },
  "En esta comunidad, he contribuido a la evaluación e implementación de traducción del contenido a otros idiomas, en particular al espanol. Igualmente, he participado en las reuniones de Book Dash, en las cuales la comunidad se reune para crear y/revisar contenido.": {
    "message": "In this community, I have contributed to the evaluation and implementation of content translation into other languages, particularly Spanish. I have also participated in the Book Dash meetings, in which the community meets to create and review content."
  },
  "Comunidad que ayuda a los investigadores principiantes a convertirse en embajadores de la Ciencia Abierta\n": {
    "message": "Community helping early career researchers become ambassadors for Open Science\n"
  },
  "Noviembre 2021 - Presente": {
    "message": "November 2021 - Present"
  },
  "La iniciativa OLS ayuda a los individuos y a las partes interesadas en la investigación a convertirse en embajadores de la Ciencia Abierta. Cuenta con un programa de entrenamiento de 16 semanas bajo el cual los participantes (organizadores, anfitriones, mentores y responsables de proyectos/alumnos):": {
    "message": "The OLS initiative helps individuals and research stakeholders become Open Science ambassadors. It has a 16-week training program under which participants (organisers, hosts, mentors and project leaders/mentees):"
  },
  "comparten su experiencia y adquieren los conocimientos esenciales para crear, dirigir y mantener un proyecto de Ciencia Abierta": {
    "message": "share their experience and acquire the essential knowledge to create, manage and maintain an Open Science project"
  },
  "conectar con miembros de diferentes proyectos, comunidades, orígenes e identidades": {
    "message": "connecting with members from different projects, communities, backgrounds and identities"
  },
  "se capacitarán mutuamente para convertirse en embajadores eficaces de la Ciencia Abierta en sus comunidades": {
    "message": "train each other to become effective Open Science ambassadors in their communities"
  },
  "Adicional al programa, OLS construye una comunidad de la cual soy orgullosamente parte desde que fui alumno con el proyecto del libro de ciencias ambientales abiertas. Bajo este programa y mi cohorte (OLS-4) realizé una mejora substancial del recurso bajo la asesoría de mi mentora, Delphine Lariviere. La experiencia como participante fue muy gratificante con una cohorte, organizadores e invitados expertos muy interesante. Mi participación trascendió de ser alumno, y por ejemplo en la cohorte siguiente, OLS5, estoy participando como mentor de un proyecto de Ciencia Abierta Multilingüe en Asia Central. Mi apoyo a este proyecto en particular se vincula a mis contribuciones en la traducción del recurso en línea de The Turing Way.": {
    "message": "In addition to the program, OLS builds a community of which I am proudly a part since I was a student with the Environmental Data Science book project. Under this program and my cohort (OLS-4) I made a substantial improvement to the resource under the guidance of my mentor, Delphine Lariviere. The experience as a participant was very rewarding with a very interesting cohort, organisers and expert guests. My involvement transcended being a mentee, and for example in the next cohort, OLS5, I am participating as a mentor for a Multilingual Open Science project in Central Asia. My support for this particular project is linked to my contributions in translating The Turing Way online resource."
  },
  "theme.ErrorPageContent.title": {
    "message": "This page crashed.",
    "description": "The title of the fallback page when the page crashed"
  },
  "theme.ErrorPageContent.tryAgain": {
    "message": "Try again",
    "description": "The label of the button to try again when the page crashed"
  },
  "theme.NotFound.title": {
    "message": "Page Not Found",
    "description": "The title of the 404 page"
  },
  "theme.NotFound.p1": {
    "message": "We could not find what I was looking for.",
    "description": "The first paragraph of the 404 page"
  },
  "theme.NotFound.p2": {
    "message": "Contact the owner of the site that linked you to the original URL and let them know that your link is broken.",
    "description": "The 2nd paragraph of the 404 page"
  },
  "theme.blog.archive.title": {
    "message": "File",
    "description": "The page & hero title of the blog archive page"
  },
  "theme.blog.archive.description": {
    "message": "File",
    "description": "The page & hero description of the blog archive page"
  },
  "theme.AnnouncementBar.closeButtonAriaLabel": {
    "message": "Close",
    "description": "The ARIA label for close button of announcement bar"
  },
  "theme.blog.paginator.navAriaLabel": {
    "message": "Navigation through the blog list page ",
    "description": "The ARIA label for the blog pagination"
  },
  "theme.blog.paginator.newerEntries": {
    "message": "Most recent entries",
    "description": "The label used to navigate to the newer blog posts page (previous page)"
  },
  "theme.blog.paginator.olderEntries": {
    "message": "Older entries",
    "description": "The label used to navigate to the older blog posts page (next page)"
  },
  "theme.blog.post.readingTime.plurals": {
    "message": "One minute reading|{readingTime} min of reading",
    "description": "Pluralized label for \"{readingTime} min read\". Use as much plural forms (separated by \"|\") as your language support (see https://www.unicode.org/cldr/cldr-aux/charts/34/supplemental/language_plural_rules.html)"
  },
  "theme.blog.post.readMoreLabel": {
    "message": "Read more about {title}",
    "description": "The ARIA label for the link to full blog posts from excerpts"
  },
  "theme.blog.post.readMore": {
    "message": "Read more",
    "description": "The label used in blog post item excerpts to link to full blog posts"
  },
  "theme.blog.post.paginator.navAriaLabel": {
    "message": "Blog post pagination bar",
    "description": "The ARIA label for the blog posts pagination"
  },
  "theme.blog.post.paginator.newerPost": {
    "message": "Most recent publication",
    "description": "The blog post button label to navigate to the newer/previous post"
  },
  "theme.blog.post.paginator.olderPost": {
    "message": "Oldest publication",
    "description": "The blog post button label to navigate to the older/next post"
  },
  "theme.BackToTopButton.buttonAriaLabel": {
    "message": "Go back to the start",
    "description": "The ARIA label for the back to top button"
  },
  "theme.blog.post.plurals": {
    "message": "Una publicación|{count} publicaciones",
    "description": "Pluralized label for \"{count} posts\". Use as much plural forms (separated by \"|\") as your language support (see https://www.unicode.org/cldr/cldr-aux/charts/34/supplemental/language_plural_rules.html)"
  },
  "theme.blog.tagTitle": {
    "message": "{nPosts} etiquetados con \"{tagName}\"",
    "description": "The title of the page for a blog tag"
  },
  "theme.tags.tagsPageLink": {
    "message": "View All Tags",
    "description": "The label of the link targeting the tag list page"
  },
  "theme.colorToggle.ariaLabel": {
    "message": "Switch between dark and light mode (currently {mode})",
    "description": "The ARIA label for the navbar color mode toggle"
  },
  "theme.colorToggle.ariaLabel.mode.dark": {
    "message": "dark mode",
    "description": "The name for the dark color mode"
  },
  "theme.colorToggle.ariaLabel.mode.light": {
    "message": "light mode",
    "description": "The name for the light color mode"
  },
  "theme.docs.breadcrumbs.home": {
    "message": "Home page",
    "description": "The ARIA label for the home page in the breadcrumbs"
  },
  "theme.docs.breadcrumbs.navAriaLabel": {
    "message": "Breadcrumbs",
    "description": "The ARIA label for the breadcrumbs"
  },
  "theme.docs.DocCard.categoryDescription": {
    "message": "{count} items",
    "description": "The default description for a category card in the generated index about how many items this category includes"
  },
  "theme.docs.paginator.navAriaLabel": {
    "message": "Document page navigation",
    "description": "The ARIA label for the docs pagination"
  },
  "theme.docs.paginator.previous": {
    "message": "Previous",
    "description": "The label used to navigate to the previous doc"
  },
  "theme.docs.paginator.next": {
    "message": "Next",
    "description": "The label used to navigate to the next doc"
  },
  "theme.docs.tagDocListPageTitle.nDocsTagged": {
    "message": "Un documento etiquetado|{count} documentos etiquetados",
    "description": "Pluralized label for \"{count} docs tagged\". Use as much plural forms (separated by \"|\") as your language support (see https://www.unicode.org/cldr/cldr-aux/charts/34/supplemental/language_plural_rules.html)"
  },
  "theme.docs.tagDocListPageTitle": {
    "message": "{nDocsTagged} con \"{tagName}\"",
    "description": "The title of the page for a docs tag"
  },
  "theme.docs.versionBadge.label": {
    "message": "Version: {versionLabel}"
  },
  "theme.docs.versions.unreleasedVersionLabel": {
    "message": "Esta es documentación sin liberar para {siteTitle} {versionLabel} versión.",
    "description": "The label used to tell the user that he's browsing an unreleased doc version"
  },
  "theme.docs.versions.unmaintainedVersionLabel": {
    "message": "Esta es documentación para {siteTitle} {versionLabel}, que ya no se mantiene activamente.",
    "description": "The label used to tell the user that he's browsing an unmaintained doc version"
  },
  "theme.docs.versions.latestVersionSuggestionLabel": {
    "message": "Para la documentación actualizada, vea {latestVersionLink} ({versionLabel}).",
    "description": "The label used to tell the user to check the latest version"
  },
  "theme.docs.versions.latestVersionLinkLabel": {
    "message": "última versión",
    "description": "The label used for the latest version suggestion link label"
  },
  "theme.common.editThisPage": {
    "message": "Editar esta página",
    "description": "The link label to edit the current page"
  },
  "theme.common.headingLinkTitle": {
    "message": "Enlace directo al encabezado",
    "description": "Title for link to heading"
  },
  "theme.lastUpdated.atDate": {
    "message": " en {date}",
    "description": "The words used to describe on which date a page has been last updated"
  },
  "theme.lastUpdated.byUser": {
    "message": " por {user}",
    "description": "The words used to describe by who the page has been last updated"
  },
  "theme.lastUpdated.lastUpdatedAtBy": {
    "message": "Última actualización{atDate}{byUser}",
    "description": "The sentence used to display when a page has been last updated, and by who"
  },
  "theme.navbar.mobileVersionsDropdown.label": {
    "message": "Versiones",
    "description": "The label for the navbar versions dropdown on mobile view"
  },
  "theme.common.skipToMainContent": {
    "message": "Saltar al contenido principal",
    "description": "The skip to content label used for accessibility, allowing to rapidly navigate to main content with keyboard tab/enter navigation"
  },
  "theme.tags.tagsListLabel": {
    "message": "Etiquetas:",
    "description": "The label alongside a tag list"
  },
  "theme.blog.sidebar.navAriaLabel": {
    "message": "Navegación de publicaciones recientes",
    "description": "The ARIA label for recent posts in the blog sidebar"
  },
  "theme.CodeBlock.copied": {
    "message": "Copiado",
    "description": "The copied button label on code blocks"
  },
  "theme.CodeBlock.copyButtonAriaLabel": {
    "message": "Copiar código al portapapeles",
    "description": "The ARIA label for copy code blocks button"
  },
  "theme.CodeBlock.copy": {
    "message": "Copiar",
    "description": "The copy button label on code blocks"
  },
  "theme.CodeBlock.wordWrapToggle": {
    "message": "Toggle word wrap",
    "description": "The title attribute for toggle word wrapping button of code block lines"
  },
  "theme.DocSidebarItem.toggleCollapsedCategoryAriaLabel": {
    "message": "Toggle the collapsible sidebar category '{label}'",
    "description": "The ARIA label to toggle the collapsible sidebar category"
  },
  "theme.navbar.mobileLanguageDropdown.label": {
    "message": "Languages",
    "description": "The label for the mobile language switcher dropdown"
  },
  "theme.TOCCollapsible.toggleButtonLabel": {
    "message": "En esta página",
    "description": "The label used by the button on the collapsible TOC component"
  },
  "theme.docs.sidebar.collapseButtonTitle": {
    "message": "Colapsar barra lateral",
    "description": "The title attribute for collapse button of doc sidebar"
  },
  "theme.docs.sidebar.collapseButtonAriaLabel": {
    "message": "Colapsar barra lateral",
    "description": "The title attribute for collapse button of doc sidebar"
  },
  "theme.navbar.mobileSidebarSecondaryMenu.backButtonLabel": {
    "message": "← Volver al menú principal",
    "description": "The label of the back button to return to main menu, inside the mobile navbar sidebar secondary menu (notably used to display the docs sidebar)"
  },
  "theme.docs.sidebar.expandButtonTitle": {
    "message": "Expandir barra lateral",
    "description": "The ARIA label and title attribute for expand button of doc sidebar"
  },
  "theme.docs.sidebar.expandButtonAriaLabel": {
    "message": "Expandir barra lateral",
    "description": "The ARIA label and title attribute for expand button of doc sidebar"
  }
}
