{
    "version": "https://jsonfeed.org/version/1",
    "title": "Alejandro Coca-Castro Blog",
    "home_page_url": "https://acocac.github.io/blog",
    "description": "Alejandro Coca-Castro Blog",
    "items": [
        {
            "id": "alejandro-101_p2-blog-post",
            "content_html": "<p><img loading=\"lazy\" alt=\"alt=Línea de tiempo\" src=\"/assets/images/timeline_070422-de7269e0b5e1d18a74a2c42aa0c611ec.jpeg\" width=\"3016\" height=\"1694\" class=\"img_ev3q\"></p><h1>Hola mundo</h1><p>En la anterior entrega describí en mi trayectoria desde el pregrado a doctorado, la cual fue sin duda una etapa satisfactoria con bastante crecimiento personal y con innumerables logros académicos y profesionales.\nPara la segunda entrega compartiré lo vivido durante la pandemia, un periodo muy difícil para toda la humanidad, pero que nos recuerda lo frágiles que somos como cualquier otra especie viviente en la tierra.</p><h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"continuemos\">¡Continuemos!<a class=\"hash-link\" href=\"#continuemos\" title=\"Enlace directo al encabezado\">​</a></h2><h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"etapa-3-pandemia-e-incertidumbres\">Etapa 3 <sub><sup>Pandemia e incertidumbres</sup></sub><a class=\"hash-link\" href=\"#etapa-3-pandemia-e-incertidumbres\" title=\"Enlace directo al encabezado\">​</a></h3><p>Comenzamos en marzo de 2020, cuando las restricciones por COVID-19 iniciaron en la mayoría de los países y coincidieron con el plazo límite para entregar mi tesis de doctorado.\nAún más, era el mes de finalización de los fondos del crédito-beca otorgado por mi patrocinador. No teniendo muchas opciones, decidimos con mi esposa dejar Londres y regresar a Bogotá (mi ciudad natal).\nA pesar de todas las presiones posibles, cumplí con el propósito de enviar mi tesis el día 30 de marzo de 2020 ¡un día muy memorable! Posteriormente en mayo de 2020 defendí mi tesis de manera remota celebrando por videollamada con mi familia, supervisores y amigos.\nLuego recibí mi diploma de doctor de Geografía en King’s College London en septiembre de 2020.</p><p>Dentro del periodo de correcciones de mi tesis y búsqueda de opciones laborales fui seleccionado en un programa de capacitación virtual de ciencias de datos del gobierno de Colombia organizado por Correlation One.\nComo parte del programa, con otros participantes aplicamos lo aprendido en un proyecto enfocado al desarrollo de modelos y tablero de datos para predecir la reincidencia en el sistema penal colombiano (ver detalles <a href=\"/projects/#ds4a-recidivism\">aquí</a>).\nPosteriormente en agosto de 2020, me vinculé como contratista del Instituto Geográfico Agustín Codazzi, una entidad del gobierno colombiano conocida por su rol en la cartografía y ordenamiento territorial. En mi contrato de 5 meses tuve la oportunidad de ser el líder técnico de grupos de 5 a 6 investigadores y publicar en revistas científicas resultados de dos proyectos relacionados con tecnologías de ciencias de datos e inteligencia artificial para el mapeo de construcciones en ámbitos rurales (ver detalles <a href=\"/projects/#igac-ruralbuildings\">aquí</a>) y el mapeo digital de suelos (ver detalles <a href=\"/projects/#igac-soils\">aquí</a>).\nAsimismo, coordiné un reto del programa de ciencia de datos de Correlation One que buscaba desarrollar modelos predictivos a partir de una base de datos de suelos del IGAC (ver repositorio <a href=\"https://github.com/DS4A-IGAC-project\" target=\"_blank\" rel=\"noopener noreferrer\">aquí</a>).</p><p>Con la culminación de mi contrato en el IGAC y no teniendo mucho éxito en la búsqueda de opciones en la academia, decidí tomar el camino de emprender.\nEn este camino cabe resaltar que fueron valiosos los aprendizajes que recibí en un programa extracurricular ofrecido por el <a href=\"https://www.kcl.ac.uk/entrepreneurship\" target=\"_blank\" rel=\"noopener noreferrer\">instituto de emprendimiento de mi universidad</a> durante el doctorado.\nDe esta manera, registré GeoMagic Labs, una empresa consultora de tecnologías de la geolocalización, en la Cámara de Comercio de Bogotá.\nCon mi emprendimiento quedé seleccionado en un concurso de consultoría con Solidaridad Network, una ONG enfocada en facilitar el desarrollo de cadenas de suministro socialmente responsables, ecológicamente sólidas y rentables.\nEn mi propuesta desarrollé una metodología para el mapeo de sistemas productivos de café usando imágenes satelitales de acceso abierto (ver detalles <a href=\"/projects/#solidaridad-cafe\">aquí</a>).</p><details class=\"details_lb9f alert alert--info details_b_Ee\" data-collapsed=\"true\"><summary>Oportunidad 4 - Entrenamiento en Ciencias de Datos </summary><div><div class=\"collapsibleContent_i85q\">La ciencia de datos ha ganado sin duda un rol importante en los diferentes dominios del conocimiento con impacto en todos los sectores. Debido a esto, un sin número de programas de capacitación y recursos se encuentran disponibles. En mi caso, aprovechando el periodo de incertidumbre y la virtualidad, me puse en la tarea de buscar cómo mejorar mis habilidades en la ciencia de datos. De esta manera encontré el programa de<!-- --> <a href=\"https://www.correlation-one.com/data-science-for-all-colombia\" target=\"_blank\" rel=\"noopener noreferrer\">Data Science for All (DS4A)</a> <!-- -->de CorrelationOne. Con recursos del gobierno de Colombia, este programa ofrece 13 semanas de entrenamiento abierto a todos los ciudadanos colombianos que estén interesados en fortalecer sus habilidades en ciencia de datos y unirse al creciente ecosistema de inteligencia artificial en Colombia. Para participar se debe pasar un examen de admisión que evalúa conocimientos generales de estadística, programación y razonamiento lógico. El programa es muy interesante, ya que no solo se recibe entrenamiento, si no que se tienen charlas con profesionales de la industria y la academia contando cómo usan la ciencia de datos en su día a día. Puedo describir el programa como de nivel básico a intermedio con ejemplos muy prácticos y la posibilidad de trabajar en equipo para poner en práctica todos los conocimientos a través de un proyecto aplicado propuesto por instituciones del gobierno, del sector privado o ONGs. CorrelationOne ofrece otros programas de entrenamiento enfocados en mujeres, empoderamiento, ingeniería, entre otros que están abiertos a cualquier nacionalidad.</div></div></details><h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"etapa-4-la-ciencia-abierta-mayo-2021---a-la-fecha\">Etapa 4 <sub><sup>La ciencia abierta, Mayo 2021 - a la fecha</sup></sub><a class=\"hash-link\" href=\"#etapa-4-la-ciencia-abierta-mayo-2021---a-la-fecha\" title=\"Enlace directo al encabezado\">​</a></h3><p>En noviembre de 2020 el reglamento de condonación del patrocinador de mi doctorado tuvo un cambio que abrió puertas a nuevas oportunidades.\nYa no era obligatorio demostrar vinculación a una institución en Bogotá por el tiempo que recibí financiación (¡ósea 4 años!).\nEl nuevo reglamento era flexible con otros tipos de productos incluyendo la publicación de artículos y/o iniciar un emprendimiento relacionado con el tema de doctorado.\nBajo este nuevo panorama, apliqué a una plaza postdoctoral en el instituto de Alan Turing en Reino Unido en diciembre de 2020.\nYo ya estaba familiarizado con el entorno del Turing por una anterior oportunidad de hackathon colaborativo que había participado en diciembre de 2019 (ver el reporte <a href=\"https://doi.org/10.5281/zenodo.3878457\" target=\"_blank\" rel=\"noopener noreferrer\">aquí</a>).\nLa plaza postdoctoral se ajustaba a mi perfil, y me llamó la atención la posibilidad de aprender de modelación probabilística, mejorar las habilidades en el desarrollo de software y contribuir a <a href=\"https://pangeo.io/\" target=\"_blank\" rel=\"noopener noreferrer\">Pangeo</a>, una comunidad que promulga la ciencia abierta para el análisis de grandes datos en la geociencia. </p><p>En el mes de febrero de 2021 recibí una comunicación para una entrevista la cual incluía una presentación de 5 min, seguido de una explicación de código de mi autoría y preguntas por parte del panel de la entrevista.\nEra mi primera entrevista de postdoctorado por lo que era natural tener un poco de nervios.\nNo obstante, ofrecí respuestas acertadas resaltando mi experiencia colaborando en diversos grupos de investigación.\nEn el momento de mostrar mi código logré demostrar cómo este había sido usado o visitado en Zenodo (una plataforma para registrar cualquier objeto digital de investigación).\nA las pocas semanas recibí la comunicación de oferta de la plaza iniciando remotamente desde mayo de 2021.\nPosteriormente, con mi esposa dejamos nuestra vida en Bogotá y decidimos reiniciar nuestra vida en Londres a finales del mes de julio de ese mismo año. </p><p>Al ser parte del Turing, he tenido la oportunidad de colaborar con múltiples investigadores en Reino Unido y sus redes de colaboración, a continuación índico los proyectos o iniciativas que activamente colaboro:</p><ul><li>Mi proyecto postdoctoral consiste en el desarrollo de herramientas basadas en la fusión inteligente de datos de sensores ambientales para mejorar el monitoreo de nuestro planeta cambiante (ver detalles <a href=\"/projects/#turing-envsensors\">aquí</a>). En colaboración con investigadores del British Antarctic Survey y Met Office estamos desarrollando una herramienta basada en modelación probabilística que combina datos de diferentes modalidades (datos de grid, estaciones in situ y auxiliares) para tener observaciones más finas y locales de variables ambientales. En adición, con algoritmos greedy (o voraz) se plantea que la herramienta sugiera donde instalar sensores locales para reducir la incertidumbre de la variable ambiental modelada. Soy afortunado en poder aportar mi experiencia en el desarrollo de la herramienta, en mi caso trabajando con investigadores del Centro de Ecología e Hidrología del Reino Unido (UKCEH) para modelar la humedad del suelo.</li><li>Soy el fundador y líder del libro de Ciencias de Datos Ambientales (ver detalles <a href=\"/communities/#envdsbook\">aquí</a>). Es un recurso liderado por la comunidad ambiental donde a partir de Jupyter notebooks se demuestran avances en datos, metodologías y otro tipo de investigación usando herramientas de código abierto. A través de esta iniciativa colaboro con otros integrantes de la comunidad de Pangeo en Europa para poder incrementar la democratización de herramientas escalables y de código abierto para geociencias. </li><li>Soy miembro y desarrollador en <em>scivision</em> (ver detalles <a href=\"/projects/#turing-scivision\">aquí</a>), una herramienta de código abierto desarrollada entre investigadores de diferentes dominios, entre ellos biología molecular, agricultura y medioambiente, así como profesionales del equipo de ingeniería de la Investigación del Turing. Mi rol en el proyecto es asegurar que la herramienta es generalizable para una variedad de imágenes (satelitales, drones, datos climáticos, entre otros) y modelos de la comunidad científica de las ciencias ambientales.</li><li>Soy miembro y colíder del equipo de traducción en The Turing Way, una iniciativa liderada por la comunidad para promover las buenas prácticas de ciencia abierta y reproducible (ver detalles <a href=\"/communities/#ttw\">aquí</a>). </li></ul><details class=\"details_lb9f alert alert--info details_b_Ee\" data-collapsed=\"true\"><summary>Oportunidad 5 - Comunidades y capacitación en ciencia abierta </summary><div><div class=\"collapsibleContent_i85q\">Más allá de mejorar mis habilidades y buenas prácticas de programación para aplicaciones ambientales, la última etapa me ha permitido pertenecer y aportar a la comunidad de ciencia abierta. A pesar de haber pertenecido a grupos de investigación desde mi pregrado, pienso que las comunidades de ciencia abierta son las que mayor potencial tienen para tener impacto en nuestra sociedad a largo plazo. Ejemplo de estas comunidades son The Turing Way y Pangeo, la primera enfocada a una audiencia general y la otra a la comunidad de geociencias. Son comunidades que promueven una visión de la ciencia en la cual cualquier persona puede contribuir a una meta común, democratizar el conocimiento y buenas prácticas en los proyectos en diferentes sectores productivos. The Turing Way tiene un diverso canal de comunicaciones (ver detalles<!-- --> <a href=\"https://hackmd.io/@turingway/demo-intro\" target=\"_blank\" rel=\"noopener noreferrer\">aquí</a>), pero lo que aconsejo en primera instancia es unirse al<!-- --> <a href=\"https://theturingway.slack.com/join/shared_invite/zt-fn608gvb-h_ZSpoA29cCdUwR~TIqpBw#/shared-invite/email\" target=\"_blank\" rel=\"noopener noreferrer\">Slack</a>. Con cerca de 400 miembros, este es el espacio donde mayormente se pueden intercambiar ideas con todos los miembros y enterarse de las actividades de la comunidad. En el transcurso del año se organizan semanas `book dash` que son eventos tipo hackáthones en los cuales se proponen diversas actividades como proponer o revisar contenido del recurso online, charlas cortas en temas diversos de la ciencia abierta y espacios de socialización o networking entre los miembros. Diferente a los tradicionales hackáthones, no existe competencia por algún premio, cualquier contribución hace parte de una celebración común. A través The Turing Way, también conocí el programa<!-- --> <a href=\"https://openlifesci.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Open Life Science (OLS)</a>. Es otra comunidad la cual ofrece 16 semanas de entrenamiento en liderazgo de ciencia abierta. Yo participé en la cuarta cohorte para validar la idea del libro de ciencias de datos ambientales por medio de reuniones con mi mentora. Posteriormente, fui co-mentor de un proyecto de conocimiento multi-lenguaje de ciencia abierta en Asia Central en la quinta cohorte. Ambas experiencias fueron valiosas, ya que en la primera pude aprender de las nociones básicas para liderar un proyecto de ciencia abierta, y posteriormente retorna lo aprendido mediante mi rol de mentoría. Recomiendo totalmente unirse a OLS, son abiertos a cualquier rama del conocimiento en el cual se quiera practicar la ciencia abierta.</div></div></details><h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"resumen\">Resumen<a class=\"hash-link\" href=\"#resumen\" title=\"Enlace directo al encabezado\">​</a></h2><p>Hemos finalizado la segunda entrega de Alejandro 101.\nEs un gusto poder compartir mi desarrollo profesional y académico, así como algunas oportunidades para aquellos interesados en ciencia medioambiental abierta y tecnologías de la información. </p><p>Aprovecho para indicar que si mi contenido es relevante estaré publicando mensualmente (si lo permite mi actual carga laboral y familiar) diversos temas desde discusiones de herramientas (con código) así como conceptos o esquemas propuestos en temas de ciencia abierta, ambiental o tecnologías de la información.\nDe vez en cuando compartiré uno que otro avance de mi vida personal o viajes que puedan ser enriquecedores para otros lectores de este blog.</p><p>Por una ciencia incluyente y transparente 🚀</p>",
            "url": "https://acocac.github.io/blog/alejandro-101_p2-blog-post",
            "title": "Alejandro 101 - Parte 2",
            "summary": "alt=Línea de tiempo",
            "date_modified": "2022-08-08T00:00:00.000Z",
            "author": {
                "name": "Alejandro Coca-Castro"
            },
            "tags": [
                "personal"
            ]
        },
        {
            "id": "alejandro-101-blog-post",
            "content_html": "<p><img loading=\"lazy\" alt=\"alt=Línea de tiempo\" src=\"/assets/images/timeline_070422-de7269e0b5e1d18a74a2c42aa0c611ec.jpeg\" width=\"3016\" height=\"1694\" class=\"img_ev3q\"></p><h1>Hola mundo</h1><p>Motivado por la línea de tiempo con la cual participé en la <a href=\"https://twitter.com/turingway/status/1538893924022259712?ref_src=twsrc%5Etfw/\" target=\"_blank\" rel=\"noopener noreferrer\">reunión de fogón</a> organizada por el Turing Way la primera entrada de mi blog es una reflexión de lo que ha sido mi recorrido en los últimos 11 años.</p><p>Contaré resumidamente mis experiencias más relevantes en la ciencia medioambiental abierta y tecnologías de la información mediante una serie de anécdotas por etapas. Dichas anécdotas van más allá de lo técnico e incluyen oportunidades que comparto para que sean aprovechadas por otros identificados con caminos similares.</p><h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"iniciemos\">¡Iniciemos!<a class=\"hash-link\" href=\"#iniciemos\" title=\"Enlace directo al encabezado\">​</a></h2><h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"etapa-0-inicios--2011\">Etapa 0 <sub><sup>inicios, &lt; 2011</sup></sub><a class=\"hash-link\" href=\"#etapa-0-inicios--2011\" title=\"Enlace directo al encabezado\">​</a></h3><p>Aunque no lo pude reflejar en mi línea de tiempo, desde mis estudios de pregrado en Ingeniería Agronómica obtuve mis primeros acercamientos en las tecnologías de la información espacial.\nTuve la oportunidad de cursar materias relacionadas con modelos y datos espaciales como parte del programa de posgrado de Geomática en mi alma mater, la Universidad Nacional de Colombia.\nIgualmente, realicé un intercambio con la Universidad de São Paulo, Brasil, donde conocí una nueva cultura y participé en grupos de investigación usando las tecnologías de geoprocesamiento aplicadas para estudios del medio ambiente y agricultura.\nEn este intercambio me entrené en varias herramientas de procesamiento de imágenes satelitales tanto de licencia cerrada entre ellas ERDAS y ENVI, y de licencia abierta como SPRING.\nAsimismo, mis conocimientos en SIG fueron principalmente en ArcGIS, y un poco en QGIS.\nYa finalizando mis estudios, en el mes de Mayo de 2011 tuve la oportunidad de poner a prueba mis conocimientos con mi primera consultoría realizando una base de datos y cartografía para un catálogo de plantas medicinales en Colombia (ver detalles <a href=\"/projects/#unal-aromatic\">aquí</a>).</p><details class=\"details_lb9f alert alert--info details_b_Ee\" data-collapsed=\"true\"><summary>Oportunidad 1 - Movilidad internacional</summary><div><div class=\"collapsibleContent_i85q\">¿Sabías que la mayoría de programas de pregrado cuentan con programas de intercambio con universidades internacionales? Por ejemplo, la Oficina de Relaciones Interinstitucionales (<a href=\"http://ori.bogota.unal.edu.co/\" target=\"_blank\" rel=\"noopener noreferrer\">ORI</a>) de la Universidad Nacional de Colombia tiene una serie de convenios con múltiples universidades a nivel mundial. Gracias a estos convenios, yo pude estar durante 6 meses en Brasil, y asimismo recibí apoyo para participar en una conferencia en XV Simposio de Sensoriamento Remoto de Brasil, en la cual presente resultados de mi investigación de unos de los grupos de los que estuve involucrado (ver el artículo<!-- --> <a href=\"http://marte.sid.inpe.br/col/dpi.inpe.br/marte/2011/07.13.13.19/doc/p1386.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">aquí</a>). Si estas en pregrado o postgrado te invito mirar estos programas que muchas veces pasan desapercibidos, pero que son muy beneficiosos para conocer culturas y maneras de aplicar la ciencia en otros contextos.</div></div></details><h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"etapa-1--datos-abiertos-de-deforestación-2011-2014\">Etapa 1 <sub><sup> datos abiertos de deforestación, 2011-2014</sup></sub><a class=\"hash-link\" href=\"#etapa-1--datos-abiertos-de-deforestación-2011-2014\" title=\"Enlace directo al encabezado\">​</a></h3><p>Como parte de mi práctica profesional del pregrado ingresé al proyecto <a href=\"http://www.terra-i.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Terra-i</a> en el Centro Internacional de Agricultura Tropical (CIAT), ahora conocido como la <a href=\"https://alliancebioversityciat.org\" target=\"_blank\" rel=\"noopener noreferrer\">Alianza Bioversity-CIAT</a>.\nEste proyecto tuvo un impacto muy positivo en mi desarrollo profesional.\nTerra-i es una iniciativa para el monitoreo global de la pérdida del hábitat generando alertas de deforestación de manera gratuita y abierta.\nDebido a la relevancia del proyecto con la agenda de la organización, participé en varios subproyectos que usaban los datos de la herramienta para cuantificar el estado de los ecosistemas en Latinoamérica y Caribe así como para pronosticar el impacto de proyectos de infraestructura vial en la región (ver detalles <a href=\"/projects/#ciat-terrai\">aquí</a>).</p><p>Como investigador proactivo representé el proyecto en varios eventos internacionales en temas de conservación, bosques y tecnologías geoespaciales.\nAsimismo, promoví extensivamente el uso de los datos abiertos a través de estudios de caso en el blog del proyecto (ver por <a href=\"http://www.terra-i.org/news/news/Is-the--Paraguayan-Gran-Chaco--at-risk-for-extreme-habitat-destruction-.html\" target=\"_blank\" rel=\"noopener noreferrer\">ejemplo</a>).\nFui autor y coordinador de un protocolo para la validación en campo de las alertas de deforestación en el Amazonas peruano el cual posteriormente fue replicado en otras regiones.\nEn términos de comunidades, fui becario de la <a href=\"https://scgis.org/about\" target=\"_blank\" rel=\"noopener noreferrer\">Sociedad para la Conservación SIG (SCGIS)</a>, un programa financiado por ESRI y organizaciones ambientales, que personalmente recomiendo para mejorar conocimientos en herramientas SIG y conocer otros investigadores a nivel mundial aplicando estas tecnologías para la conservación.</p><details class=\"details_lb9f alert alert--info details_b_Ee\" data-collapsed=\"true\"><summary>Oportunidad 2 - Programas de entrenamiento en SIG</summary><div><div class=\"collapsibleContent_i85q\">Como lo comenté en la parte final, tuve la oportunidad de ser becario del programa SCGIS. La aplicación se abre anualmente y selecciona profesionales trabajando en el área de conservación para que mejoran su conocimientos en herramientas SIG, principalmente ArcGIS (ver detalles<!-- --> <a href=\"https://scgis.org/training\" target=\"_blank\" rel=\"noopener noreferrer\">aquí</a>). Asimismo, el programa permite que los becarios presenten su trabajo en la<!-- --> <a href=\"https://www.esri.com/en-us/about/events/uc/overview\" target=\"_blank\" rel=\"noopener noreferrer\">conferencia de usuarios ESRI</a> <!-- -->así como en la<!-- --> <a href=\"https://scgis.org/conference\" target=\"_blank\" rel=\"noopener noreferrer\">conferencia anual de SCGIS</a>. El proceso es bien competido pero con una buena motivación, preparación y evidencia del trabajo de conservación en el formulario de la aplicación es posible ser seleccionado. Es importante indicar que el programa cubre parcialmente los costos, y por tanto es necesario contar con apoyo externo de ciertos gastos como pasajes de avión y visa en caso de necesitar. Otros programas de capacitaciones o escuelas de verano pueden encontrarse en diferentes temáticas adicionales a la conservación. Mi consejo es buscar aquellas donde tengas una mayor afinidad, y donde ofrezcan la posibilidad de seguir conectado con los instructores y colegas que hacen parte de tu cohorte.</div></div></details><h3 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"etapa-2--msc-y-phd-en-geografía-2014-2020\">Etapa 2 <sub><sup> MSc. y PhD en Geografía, 2014-2020</sup></sub><a class=\"hash-link\" href=\"#etapa-2--msc-y-phd-en-geografía-2014-2020\" title=\"Enlace directo al encabezado\">​</a></h3><p>Como parte del proyecto Terra-i, conocí a <a href=\"https://www.kcl.ac.uk/people/mark-mulligan\" target=\"_blank\" rel=\"noopener noreferrer\">Mark Mulligan</a>, profesor de King’s College London con quien en colaboración con el proyecto Terra-i abordamos el estudio de las causas de deforestación en el bioma amazónico.\nFue un periodo donde me capacité y apliqué la ciencia de datos, inteligencia artificial y computación en la nube.\nDe esta manera, en mi maestría analicé los patrones espaciales de la deforestación mediante el uso de minería de datos y análisis fractal (ver detalles <a href=\"/projects/#kcl-master\">aquí</a>).\nA partir del uso de dos fuentes de datos abiertos de deforestación, Terra-i y los mapas de <a href=\"https://www.science.org/doi/10.1126/science.1244693?cookieSet=1\" target=\"_blank\" rel=\"noopener noreferrer\">Global Forest Change</a>, mi investigación logró mapear la distribución espacial de patrones espaciales asociados con diferentes agentes de deforestación.\nEn el doctorado tuve un abordaje más profundo con la aplicación de técnicas de análisis de las series de tiempo para extraer información de las coberturas y uso posterior a la deforestación a partir de imágenes satelitales (ver detalles <a href=\"/projects/#kcl-phd\">aquí</a>).\nEn esta investigación se innovó en el uso de redes neuronales recurrentes convolucionales para la clasificación de series de tiempo de imágenes MODIS.\nLos modelos fueron entrenados usando recursos hardware del proyecto Terra-i así como créditos de computación de la nube de Google.</p><p>Más allá de los avances técnicos durante mis estudios, pienso que lo más emocionante fue maximizar la colaboración y movilidad (intercambios, pasantías, conferencias y grupos de investigación).\nPor ejemplo, en mi maestría hice un intercambio en <a href=\"https://globalcanopy.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Global Canopy</a>, una ONG ambiental con sede en Oxford, Reino Unido en la cual hice un análisis de la seguridad hídrica en el Amazonas (ver detalles <a href=\"/projects/#gcp-water\">aquí</a>).\nEn el doctorado, hice intercambios en el año 2011 en HEIG-VD en Suiza y posteriormente en 2019 en la sede regional en Asia de CIAT en Vietnam.\nEn la primera institución recibí entrenamiento en programación en Python, Big Data y Deep Learning en el laboratorio liderado por el profesor <a href=\"http://www.alunaweb.net/andres/\" target=\"_blank\" rel=\"noopener noreferrer\">Andres Perez-Uribe</a>, y en el segundo perfeccioné los análisis y modelos con mi co-supervisor en CIAT, <a href=\"https://ciat.cgiar.org/ciat-coffee-cocoa-portfolio/louis-reymondin/\" target=\"_blank\" rel=\"noopener noreferrer\">Dr Louis Reymondin</a>. También quiero destacar la pasantía en el verano de 2018 realizada en <a href=\"https://sa.catapult.org.uk/\" target=\"_blank\" rel=\"noopener noreferrer\">Satellite Application Catapult</a> en el campus de ciencia e innovación de Harwell (Reino Unido) donde participé en la aceleradora <a href=\"https://frontierdevelopmentlab.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Frontier Development Lab (FDL)</a>.\nEn esta aceleradora participé con otros investigadores afiliados en instituciones de Europa para el mapeo de asentamientos ilegales a partir de imágenes de resolución media como Sentinel 2 y muy alta como WorldView-4 (ver detalles <a href=\"/projects/#fdl-illegalsettlements\">aquí</a>).</p><details class=\"details_lb9f alert alert--info details_b_Ee\" data-collapsed=\"true\"><summary>Oportunidad 3 - Créditos gratuitos de investigación para la computación de la nube de Google y Microsoft</summary><div><div class=\"collapsibleContent_i85q\">Adicional al apoyo de los recursos hardware del proyecto Terra-i, tuve la iniciativa de explorar la computación de la nube a través del programa de educación que tienen Google y Microsoft. Google cuenta con un<!-- --> <a href=\"https://edu.google.com/intl/ALL_us/programs/credits/research\" target=\"_blank\" rel=\"noopener noreferrer\">programa de créditos para la investigación</a>. Por otra parte, Microsoft tiene el programa AI for Earth en el cual se patrocina créditos de la plataforma Azure para investigaciones relacionadas con el medioambiente. A diferencia del programa generalizado de Google, los créditos del programa<!-- --> <a href=\"https://www.microsoft.com/en-us/ai/ai-for-earth-grants\" target=\"_blank\" rel=\"noopener noreferrer\">AI for Earth</a> <!-- -->van más allá de prestar el servicio de la nube y pretenden conectar todos los investigadores e iniciativas proponiendo metodologías basadas en las ciencias de datos y IA para hacer impacto en sus proyectos medioambientales. No estoy a favor de ninguno de los dos programas ya que cada uno tiene sus ventajas de acuerdo a las necesidades de la investigación y comunidad a la que desean pertenecer. Para ambos programas, se requiere completar un formulario de aplicación donde se hacen una serie de preguntas de la investigación y un estimado del total de créditos requeridos. Para maximizar los chances de ser seleccionado, mi sugerencia es aprovechar la subscripción prueba de cada proveedor de la nube. De esta manera, pueden hacer un mejor estimativo de los créditos requeridos así como de servicios adicionales que pueden mencionar en la aplicación.</div></div></details><h2 class=\"anchor anchorWithHideOnScrollNavbar_WYt5\" id=\"resumen\">Resumen<a class=\"hash-link\" href=\"#resumen\" title=\"Enlace directo al encabezado\">​</a></h2><p>En esta primera entrega de Alejandro 101 resumidamente conté mis experiencias desde mi pregrado hasta el doctorado.\nFueron diferentes personas que me inspiraron y pude colaborar durante todos estos años.\nFue un periodo lleno de muchos logros profesionales y personales con unas amistades muy valiosas que aún conservo, así como la satisfacción de poder iniciar la familia Coca Calderón durante el tercer año del doctorado.</p><p>En la próxima entrega continuaré con la segunda parte de la línea de tiempo, a partir de la cual considero estoy construyendo satisfactoriamente nuevas bases para el liderazgo de la ciencia ambiental abierta.\nIgualmente, comentaré oportunidades y experiencias que pueden resultar interesantes!</p><p>Por una ciencia incluyente y transparente 🚀</p>",
            "url": "https://acocac.github.io/blog/alejandro-101-blog-post",
            "title": "Alejandro 101 - Parte 1",
            "summary": "alt=Línea de tiempo",
            "date_modified": "2022-07-04T00:00:00.000Z",
            "author": {
                "name": "Alejandro Coca-Castro"
            },
            "tags": [
                "personal"
            ]
        }
    ]
}